tutorials/N2.jet.LES/c3.PR.LEMOS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet                
    {
        //type            fixedValue;
        //value           uniform (4.9 0 0);

        type              decayingTurbulenceInflowGenerator;
        direction         1;
        LField            uniform 0.00011;     //integral length scale = width
        refField          uniform (4.9 0 0);
        RField            uniform (0.24 0 0 0.24 0 0.24); //R = (U*I)^2, I=10%=u'/U is tur. intensity
        value             uniform (4.9 0 0);	
      
    }

    outlet
    {
        //type            zeroGradient;
        //type            pressureInletOutletVelocity;
        //value           $internalField;
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    frontWall
    {
        type            zeroGradient;
    }

    outerWall
    {   
        type            zeroGradient;
    } 
}


// ************************************************************************* //
