tutorials/N2.jet.LES/c3.PR.LEMOS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-09;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.001;
    }

    pFinal
    {
        $p;
        tolerance       1e-9;
        relTol          0;
    }

    "(U|h|Z|varZ|k|epsilon)"
    {
        //solver          PBiCGStab;
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0.001;
    }

    "(U|h|Z|varZ|k|epsilon)Final"
    {
      
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0;  
    }

    Yi
    {
        $hFinal;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{ 
    fields
    {
    }

    equations
    {
        "(U|k|epsilon).*"      0.5;
        "(Z|varZ).*"           0.5;
    }
}




// ************************************************************************* //
